blog/2014/10/30/which-shell-to-use/index.html

<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Which Shell to Use - sven&#8217;s blog</title>
  <meta name="author" content="sven">

  
  <meta name="description" content="with emacs eshell autocomplete work sshfs kill &amp; yank works Eshell does not support input redirection http://askubuntu.com/questions/229447/how- &hellip;">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  <link rel="canonical" href="http://sven--.github.io/blog/2014/10/30/which-shell-to-use">
  <link href="/favicon.png" rel="icon">
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <link href="/stylesheets/data-table.css" media="screen, projection" rel="stylesheet" type="text/css" />
  <link href="/atom.xml" rel="alternate" title="sven's blog" type="application/atom+xml">
  <!--Fonts from Google"s Web font directory at http://google.com/webfonts -->
<link href="//fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">
<link href="//fonts.googleapis.com/css?family=Open+Sans" rel="stylesheet" type="text/css">
<link href="//fonts.googleapis.com/css?family=Fjalla+One" rel="stylesheet" type="text/css">
<!--- MathJax Configuration -->
  

</head>

<body   class="collapse-sidebar sidebar-footer" >
  <header role="banner"><hgroup>
  <h1><a href="/">sven&#8217;s blog</a></h1>
  
</hgroup>

</header>
  <nav role="navigation"><ul class="subscribe" data-subscription="rss">
  <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS"><svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="25" height="25" viewbox="0 0 100 100"><path class="social" d="M 13.310204,73.332654 C 5.967347,73.332654 0,79.322448 0,86.621428 c 0,7.338776 5.967347,13.262246 13.310204,13.262246 7.370408,0 13.328572,-5.92245 13.328572,-13.262246 0,-7.29898 -5.958164,-13.288774 -13.328572,-13.288774 z M 0.01530612,33.978572 V 53.143878 C 12.493878,53.143878 24.229592,58.02347 33.068368,66.865306 41.894898,75.685714 46.767346,87.47449 46.767346,100 h 19.25 C 66.017346,63.592858 36.4,33.979592 0.01530612,33.978572 l 0,0 z M 0.03877552,0 V 19.17449 C 44.54796,19.17551 80.77551,55.437756 80.77551,100 H 100 C 100,44.87653 55.15102,0 0.03877552,0 z"></path></svg></a></li>
  
</ul>
  
  
  
  
  
  
  
    
      <form action="https://www.google.com/search" method="get">
        <fieldset role="search">
          <input type="hidden" name="q" value="site:sven--.github.io" />
    
          <input class="search" type="text" name="q" results="0" placeholder="Search"/>
        </fieldset>
      </form>
  
<ul class="main-navigation">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div>
<article class="hentry" role="article">
  
  <header>
    
      
        <h1 class="entry-title">Which Shell to Use</h1>
      
    
    
      <p class="meta">
        




<time class='entry-date' datetime='2014-10-30'><span class='date'><span class='date-month'>Oct</span> <span class='date-day'>30</span><span class='date-suffix'>th</span>, <span class='date-year'>2014</span></span> <span class='time'>12:00 am</span></time>
        
        
      </p>
    
  </header>


<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">with emacs</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">eshell</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>autocomplete work
</li>
<li>sshfs
</li>
<li>kill &amp; yank works
</li>
<li><b>Eshell does not support input redirection</b>
</li>
<li><a href="http://askubuntu.com/questions/229447/how-do-i-diff-the-output-of-two-commands">http://askubuntu.com/questions/229447/how-do-i-diff-the-output-of-two-commands</a>
</li>
<li>ssh hangs on!!!
</li>
<li><a href="http://www.gnu.org/software/emacs/manual/html_mono/eshell.html#Introduction">gnu manual</a> -&gt; 
</li>
</ul>
<p>
<figure class='code'><div class="highlight"><table><tr><td class="gutter"><pre class="line-numbers"><span class='line-number'>1</span>
<span class='line-number'>2</span>
<span class='line-number'>3</span>
<span class='line-number'>4</span>
<span class='line-number'>5</span>
</pre></td><td class='code'><pre><code class=''><span class='line'>Eshell is not a replacement for system shells such as bash or zsh. 
</span><span class='line'>Use Eshell when you want to move text between Emacs and external processes; 
</span><span class='line'>if you only want to pipe output from one external process to another (and then another, and so on), use a system shell, 
</span><span class='line'>because Emacs's IO system is buffer oriented, not stream oriented, and is very inefficient at such tasks. 
</span><span class='line'>If you want to write shell scripts in Eshell, don't; either write an elisp library or use a system shell.</span></code></pre></td></tr></table></div></figure>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">others</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>M-x shell
<ul class="org-ul">
<li>autocomplete doesn&#8217;t work (when <code>ssh</code> ing)
</li>
<li>kill &amp; yank works
</li>
</ul>
</li>

<li>M-x term (ansi-term)
<ul class="org-ul">
<li>autocomplete works
</li>
<li><del>kill &amp; yank doesn&#8217;t work</del> Actually it works, <a href="http://stackoverflow.com/questions/2886184/copy-paste-in-emacs-ansi-term-shell">here</a>.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">in terminal,</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">zsh or fish?</h3>
</div>
</div>
</div>


  <footer>
    <p class="meta">
      
  



  <span class="byline author vcard">Authored by <span class="fn">
  
    sven
  
  </span></span>


      




<time class='entry-date' datetime='2014-10-30'><span class='date'><span class='date-month'>Oct</span> <span class='date-day'>30</span><span class='date-suffix'>th</span>, <span class='date-year'>2014</span></span> <span class='time'>12:00 am</span></time>
      
      

<span class="categories">
  
    <a class='category' href='/blog/categories/emacs/'>emacs</a>, <a class='category' href='/blog/categories/shell/'>shell</a>
  
</span>


    </p>
    
      <div class="sharing">
  
  <a href="//twitter.com/share" class="twitter-share-button" data-url="http://sven--.github.io/blog/2014/10/30/which-shell-to-use/" data-via="" data-counturl="http://sven--.github.io/blog/2014/10/30/which-shell-to-use/" >Tweet</a>
  
  
  
</div>

    
    <p class="meta">
      
        <a class="basic-alignment left" href="/blog/2014/10/30/about-this-blog/" title="Previous Post: About this blog">&laquo; About this blog</a>
      
      
        <a class="basic-alignment right" href="/blog/2014/11/02/church-numeral-in-coq%3F/" title="Next Post: Church numeral in Coq?">Church numeral in Coq? &raquo;</a>
      
    </p>
  </footer>
</article>


</div>

    </div>
  </div>
  <footer role="contentinfo"><p>
  Copyright &copy; 2014 - sven -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a> | Themed with <a href="https://github.com/lucaslew/whitespace">Whitespace</a></span>
</p>

</footer>
  










  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = '//platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>





</body>
</html>
